## How to Execute/Perform Basic sqlite3 commands using Python
  * Create a database
  * Create two relational tables,  add one more table and delete it
  * populate the tables with data
  * Update a record, delete a row from a table
  * Remove or drop a table
  * Use Pandas to read a table

In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
# create instance of the new database
conn = sqlite3.connect('soccerLeague.db')
c = conn.cursor()

In [3]:
os.listdir()

['.config', 'soccerLeague.db', 'sample_data']

In [30]:
# Create tables players, clubs, dropmedead
c.execute("""CREATE TABLE IF NOT EXISTS players(first_name text, 
                                                    last_name text, 
                                                    club_id int, 
                                                    Salary Real)""")
c.execute("""CREATE TABLE IF NOT EXISTS clubs(id int,
                                            club_name text, 
                                            club_location text,  
                                            foundationYear int,
                                            capitalisation Real)""")
c.execute("""CREATE TABLE IF NOT EXISTS dropmedead(fakevalue int,
                                                    faketext text)""")

In [32]:
#Confirm the tables are created
c.execute("SELECT * FROM sqlite_master WHERE type='table'")
conn.commit()
for t in c.fetchall():
  print(t)

('table', 'players', 'players', 2, 'CREATE TABLE players(first_name text, \n                                                    last_name text, \n                                                    club_id int, \n                                                    Salary Real)')
('table', 'clubs', 'clubs', 3, 'CREATE TABLE clubs(id int,\n                                            club_name text, \n                                            club_location text,  \n                                            foundationYear int,\n                                            capitalisation Real)')
('table', 'dropmedead', 'dropmedead', 4, 'CREATE TABLE dropmedead(fakevalue int,\n                                                    faketext text)')

In [38]:
# insert values in the tables
players_list = [('Lionel', 'Messi', 11, 429832.3),
                ('Ronaldo', 'Ronaldino', 14, 122212.34),
                ('Markus', 'Rushford', 13, 983434), 
                ('Sadio', 'Mane', 19, 1722212),
                ('Muler', 'Muhler', 23, 1222124), 
                ('Figo', 'Luis', 14, 122254.4),
                ('Salah', 'Muhammed', 19, 172212), 
                ('Roberto', 'Firminio', 19, 1752212), 
                ('Alisson', 'Taylor', 19, 97212)]

clubs_list = [(11, 'Barcelona', 'Spain', 1902, 1999999), 
              (13, 'Man United', 'England', 1900, 2999999), 
              (14, 'Juventus', 'Italy', 1908, 999999),
              (19, 'Liverpool', 'England', 1900, 3999999),
              (23, 'Bayern', 'German', 1920, 2999999) ] 
def data_insert(tname, lst):
    place_holder = ','.join('?'*len(lst[0]))
    query = f"INSERT INTO {tname} VALUES({place_holder})"
    c.executemany(query, lst)

In [39]:
#inserting data in the db
data_insert('players', players_list)
data_insert('clubs', clubs_list)

In [40]:
pd.read_sql_query("SELECT * FROM players", conn)

  first_name  last_name  club_id      Salary
0     Lionel      Messi       11   429832.30
1    Ronaldo  Ronaldino       14   122212.34
2     Markus   Rushford       13   983434.00
3      Sadio       Mane       19  1722212.00
4      Muler     Muhler       23  1222124.00
5       Figo       Luis       14   122254.40
6      Salah   Muhammed       19   172212.00
7    Roberto   Firminio       19  1752212.00
8    Alisson     Taylor       19    97212.00

In [41]:
pd.read_sql_query("SELECT * FROM clubs", conn)

   id   club_name club_location  foundationYear  capitalisation
0  11   Barcelona         Spain            1902       1999999.0
1  13  Man United       England            1900       2999999.0
2  14    Juventus         Italy            1908        999999.0
3  19   Liverpool       England            1900       3999999.0
4  23      Bayern        German            1920       2999999.0

In [43]:
#update a record
query = "UPDATE players SET club_id=11 WHERE first_name='Roberto' and last_name='Firminio'"
c.execute(query)
conn.commit()
pd.read_sql_query("SELECT * FROM players", conn)

  first_name  last_name  club_id      Salary
0     Lionel      Messi       11   429832.30
1    Ronaldo  Ronaldino       14   122212.34
2     Markus   Rushford       13   983434.00
3      Sadio       Mane       19  1722212.00
4      Muler     Muhler       23  1222124.00
5       Figo       Luis       14   122254.40
6      Salah   Muhammed       19   172212.00
7    Roberto   Firminio       11  1752212.00
8    Alisson     Taylor       19    97212.00

In [48]:
c.execute("SELECT * FROM players WHERE club_id=11")
conn.commit()
for p in c.fetchall():
  print(p)

('Lionel', 'Messi', 11, 429832.3)
('Roberto', 'Firminio', 11, 1752212.0)

In [76]:
# Delete a row, first add a row then delete
c.execute("INSERT INTO players VALUES('Some', 'Player', 33, -109.9)")
conn.commit()
c.execute("SELECT * FROM players")
conn.commit()
for p in c.fetchall():
  print(p)

('Lionel', 'Messi', 11, 429832.3)
('Ronaldo', 'Ronaldino', 14, 122212.34)
('Markus', 'Rushford', 13, 983434.0)
('Sadio', 'Mane', 19, 1722212.0)
('Muler', 'Muhler', 23, 1222124.0)
('Figo', 'Luis', 14, 122254.4)
('Salah', 'Muhammed', 19, 172212.0)
('Roberto', 'Firminio', 11, 1752212.0)
('Alisson', 'Taylor', 19, 97212.0)
('Some', 'Player', 33, -109.9)

In [77]:
#Delete Some Player
c.execute("DELETE FROM players WHERE first_name='Some' and last_name='Player' ")
conn.commit()
pd.read_sql_query("SELECT * FROM players", conn)

  first_name  last_name  club_id      Salary
0     Lionel      Messi       11   429832.30
1    Ronaldo  Ronaldino       14   122212.34
2     Markus   Rushford       13   983434.00
3      Sadio       Mane       19  1722212.00
4      Muler     Muhler       23  1222124.00
5       Figo       Luis       14   122254.40
6      Salah   Muhammed       19   172212.00
7    Roberto   Firminio       11  1752212.00
8    Alisson     Taylor       19    97212.00

In [ ]:
#Drop dropmedead table
pd.read_sql_query(" SELECT * FROM sqlite_master WHERE type='table' ", conn)

In [82]:
pd.read_sql_query(" SELECT * FROM sqlite_master WHERE type='table' ", conn)

    type  ...                                                sql
0  table  ...  CREATE TABLE players(first_name text, \n      ...
1  table  ...  CREATE TABLE clubs(id int,\n                  ...
2  table  ...  CREATE TABLE dropmedead(fakevalue int,\n      ...

[3 rows x 5 columns]

In [83]:
c.execute(" DROP TABLE dropmedead")
conn.commit
c.execute("SELECT * FROM sqlite_master WHERE type='table'")
conn.commit
for t in c.fetchall():
  print(t)

('table', 'players', 'players', 2, 'CREATE TABLE players(first_name text, \n                                                    last_name text, \n                                                    club_id int, \n                                                    Salary Real)')
('table', 'clubs', 'clubs', 3, 'CREATE TABLE clubs(id int,\n                                            club_name text, \n                                            club_location text,  \n                                            foundationYear int,\n                                            capitalisation Real)')